# RadialArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RadialArray Class
Members See Also
---
An object that represents an Array created along a circle arc within the Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RadialArray : BaseArray
```

Visual Basic
---
```text
Public Class RadialArray _
	Inherits BaseArray
```

Visual C++
---
```text
public ref class RadialArray : public BaseArray
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..BaseArray Autodesk.Revit.DB..::..RadialArray
# See Also
RadialArray Members
Autodesk.Revit.DB Namespace